<template>
	<div class="culture">
		<div class="image-wrapper" v-for="(item,index) in srcList" :key="index">
			<el-image :src="item.src" fit="fill" @mouseenter="displayOverlay(index)" @mouseleave="hideOverlay(index)"
				@click="clickImg(item,index)">
			</el-image>
			<div class="image-overlay" :class="{ 'show-overlay': showOverlay === index }">
				<h3>{{item.title}}</h3>
			</div>
		</div>
	</div>
</template>

<script>
	export default {
		name: "culture.vue",
		data() {
			return {
				srcList: [{
						src: require("@/assets/culture/娄山关1.jpg"),
						title: "娄山关",
						description: "娄山关战斗是遵义会议及二渡赤水以后，中央红军在黔北大娄山主峰与黔军展开的一场激烈战斗，歼敌4个团，乘势再取遵义城。娄山关小尖山下耸立的红军战斗纪念碑的碑文写道：娄山关战斗“是遵义战役关键性的一仗，是红军长征以来的第一个大胜”。\n毛泽东同中央军委纵队过娄山关时， 夕阳西下， 寄情于景， 以豪放的气势， 咏出了传颂后世的词作《 忆秦娥· 娄山关》： 西风烈， 长空雁叫霜晨月。 霜晨月， 马蹄声碎， 喇叭声咽。 雄关漫道真如铁， 而今迈步从头越。 从头越， 苍山如海， 残阳如血。 这首词以壮烈的情怀， 反映了历经艰辛转战至此的红军对前途充满了革命必胜的希望。 "
					},
					{
						src: require("@/assets/culture/娄山关2.jpg"),
						title: "娄山关",
						description: "娄山关战斗是遵义会议及二渡赤水以后，中央红军在黔北大娄山主峰与黔军展开的一场激烈战斗，歼敌4个团，乘势再取遵义城。娄山关小尖山下耸立的红军战斗纪念碑的碑文写道：娄山关战斗“是遵义战役关键性的一仗，是红军长征以来的第一个大胜”。\n毛泽东同中央军委纵队过娄山关时， 夕阳西下， 寄情于景， 以豪放的气势， 咏出了传颂后世的词作《 忆秦娥· 娄山关》： 西风烈， 长空雁叫霜晨月。 霜晨月， 马蹄声碎， 喇叭声咽。 雄关漫道真如铁， 而今迈步从头越。 从头越， 苍山如海， 残阳如血。 这首词以壮烈的情怀， 反映了历经艰辛转战至此的红军对前途充满了革命必胜的希望。 "

					}, {
						src: require("@/assets/culture/娄山关3.jpg"),
						title: "娄山关",
						description: "娄山关战斗是遵义会议及二渡赤水以后，中央红军在黔北大娄山主峰与黔军展开的一场激烈战斗，歼敌4个团，乘势再取遵义城。娄山关小尖山下耸立的红军战斗纪念碑的碑文写道：娄山关战斗“是遵义战役关键性的一仗，是红军长征以来的第一个大胜”。\n毛泽东同中央军委纵队过娄山关时， 夕阳西下， 寄情于景， 以豪放的气势， 咏出了传颂后世的词作《 忆秦娥· 娄山关》： 西风烈， 长空雁叫霜晨月。 霜晨月， 马蹄声碎， 喇叭声咽。 雄关漫道真如铁， 而今迈步从头越。 从头越， 苍山如海， 残阳如血。 这首词以壮烈的情怀， 反映了历经艰辛转战至此的红军对前途充满了革命必胜的希望。 "

					}, {
						src: require("@/assets/culture/娄山关4.jpg"),
						title: "娄山关",
						description: "娄山关战斗是遵义会议及二渡赤水以后，中央红军在黔北大娄山主峰与黔军展开的一场激烈战斗，歼敌4个团，乘势再取遵义城。娄山关小尖山下耸立的红军战斗纪念碑的碑文写道：娄山关战斗“是遵义战役关键性的一仗，是红军长征以来的第一个大胜”。\n毛泽东同中央军委纵队过娄山关时， 夕阳西下， 寄情于景， 以豪放的气势， 咏出了传颂后世的词作《 忆秦娥· 娄山关》： 西风烈， 长空雁叫霜晨月。 霜晨月， 马蹄声碎， 喇叭声咽。 雄关漫道真如铁， 而今迈步从头越。 从头越， 苍山如海， 残阳如血。 这首词以壮烈的情怀， 反映了历经艰辛转战至此的红军对前途充满了革命必胜的希望。 "

					}, {
						src: require("@/assets/culture/娄山关5.jpg"),
						title: "娄山关",
						description: "娄山关战斗是遵义会议及二渡赤水以后，中央红军在黔北大娄山主峰与黔军展开的一场激烈战斗，歼敌4个团，乘势再取遵义城。娄山关小尖山下耸立的红军战斗纪念碑的碑文写道：娄山关战斗“是遵义战役关键性的一仗，是红军长征以来的第一个大胜”。\n毛泽东同中央军委纵队过娄山关时， 夕阳西下， 寄情于景， 以豪放的气势， 咏出了传颂后世的词作《 忆秦娥· 娄山关》： 西风烈， 长空雁叫霜晨月。 霜晨月， 马蹄声碎， 喇叭声咽。 雄关漫道真如铁， 而今迈步从头越。 从头越， 苍山如海， 残阳如血。 这首词以壮烈的情怀， 反映了历经艰辛转战至此的红军对前途充满了革命必胜的希望。 "

					}, {
						src: require("@/assets/culture/娄山关6.jpg"),
						title: "娄山关",
						description: "娄山关战斗是遵义会议及二渡赤水以后，中央红军在黔北大娄山主峰与黔军展开的一场激烈战斗，歼敌4个团，乘势再取遵义城。娄山关小尖山下耸立的红军战斗纪念碑的碑文写道：娄山关战斗“是遵义战役关键性的一仗，是红军长征以来的第一个大胜”。\n毛泽东同中央军委纵队过娄山关时， 夕阳西下， 寄情于景， 以豪放的气势， 咏出了传颂后世的词作《 忆秦娥· 娄山关》： 西风烈， 长空雁叫霜晨月。 霜晨月， 马蹄声碎， 喇叭声咽。 雄关漫道真如铁， 而今迈步从头越。 从头越， 苍山如海， 残阳如血。 这首词以壮烈的情怀， 反映了历经艰辛转战至此的红军对前途充满了革命必胜的希望。 "

					}, {
						src: require("@/assets/culture/娄山关7.jpg"),
						title: "娄山关",
						description: "娄山关战斗是遵义会议及二渡赤水以后，中央红军在黔北大娄山主峰与黔军展开的一场激烈战斗，歼敌4个团，乘势再取遵义城。娄山关小尖山下耸立的红军战斗纪念碑的碑文写道：娄山关战斗“是遵义战役关键性的一仗，是红军长征以来的第一个大胜”。\n毛泽东同中央军委纵队过娄山关时， 夕阳西下， 寄情于景， 以豪放的气势， 咏出了传颂后世的词作《 忆秦娥· 娄山关》： 西风烈， 长空雁叫霜晨月。 霜晨月， 马蹄声碎， 喇叭声咽。 雄关漫道真如铁， 而今迈步从头越。 从头越， 苍山如海， 残阳如血。 这首词以壮烈的情怀， 反映了历经艰辛转战至此的红军对前途充满了革命必胜的希望。 "

					}, {
						src: require("@/assets/culture/娄山关8.jpg"),
						title: "娄山关",
						description: "娄山关战斗是遵义会议及二渡赤水以后，中央红军在黔北大娄山主峰与黔军展开的一场激烈战斗，歼敌4个团，乘势再取遵义城。娄山关小尖山下耸立的红军战斗纪念碑的碑文写道：娄山关战斗“是遵义战役关键性的一仗，是红军长征以来的第一个大胜”。\n毛泽东同中央军委纵队过娄山关时， 夕阳西下， 寄情于景， 以豪放的气势， 咏出了传颂后世的词作《 忆秦娥· 娄山关》： 西风烈， 长空雁叫霜晨月。 霜晨月， 马蹄声碎， 喇叭声咽。 雄关漫道真如铁， 而今迈步从头越。 从头越， 苍山如海， 残阳如血。 这首词以壮烈的情怀， 反映了历经艰辛转战至此的红军对前途充满了革命必胜的希望。 "

					}, {
						src: require("@/assets/culture/茅台1.jpg"),
						title: "茅台酒",
						description: "遵义更是我国著名“酒乡”，酒文化历史悠久，我国名酒习酒、董酒皆产于此地。\n 遵义是酒乡，有着中国酒文化名城之美誉的遵义，名酒众多，世界闻名，酒文化历史悠久。二十多万年前，处于旧石器时代的“桐梓人” 开始了历史的征程， 酒文化的种子也在遵义这块土地上萌芽。 旧石器时代的人们在长期的采集劳动中， 逐渐发现了自然酒。 通过总结， 开始有意识地用含糖的水果、 蜂蜜通过自然界的发酵微生物自然生成酒， 这就是原始人工酒。 随着生产力的发展， 新石器时代， 原始农业产生， 以及陶器的普遍制作和使用， 使谷物酿酒成为可能， 新石器时代中晚期才产生了曲蘖酿酒。"
					}, {
						src: require("@/assets/culture/茅台2.jpg"),
						title: "茅台酒",
						description: "遵义更是我国著名“酒乡”，酒文化历史悠久，我国名酒习酒、董酒皆产于此地。\n遵义是酒乡， 有着中国酒文化名城之美誉的遵义， 名酒众多， 世界闻名， 酒文化历史悠久。 二十多万年前， 处于旧石器时代的“ 桐梓人” 开始了历史的征程， 酒文化的种子也在遵义这块土地上萌芽。 旧石器时代的人们在长期的采集劳动中， 逐渐发现了自然酒。 通过总结， 开始有意识地用含糖的水果、 蜂蜜通过自然界的发酵微生物自然生成酒， 这就是原始人工酒。 随着生产力的发展， 新石器时代， 原始农业产生， 以及陶器的普遍制作和使用， 使谷物酿酒成为可能， 新石器时代中晚期才产生了曲蘖酿酒。 "

					},
				],
				showOverlay: false,
			}
		},
		methods: {
			displayOverlay(index) {
				this.showOverlay = index;
			},
			hideOverlay(index) {
				this.showOverlay = false;
			},
			//点击图片进行跳转，传item和index
			clickImg(item, index) {
				this.$router.push({
					name: 'detail',
					params: {
						src: item.src,
						title: item.title,
						description: item.description,
					}
				})
			}
		}
	}
</script>

<style scoped lang="less">
	.culture {
		display: flex;
		flex-wrap: wrap;
		justify-content: flex-start;
		width: 100%;
		margin-right: -20px;

		/* 负值用于抵消间隔 */
		.image-wrapper {
			flex-basis: calc(25% - 20px);
			/* 每行容纳4个el-image，减去间隔的宽度 */
			margin: 10px;
			height: 350px;
			cursor: pointer;
			position: relative;
			overflow: hidden;
			transition: transform 0.5s cubic-bezier(0.30, 0, 0.70, 1);

			.el-image {
				width: 100%;
				height: 100%;
				border-radius: 5%;
			}

			.image-overlay {
				position: absolute;
				z-index: 999;
				height: 100%;
				top: 290px;
				left: 0;
				right: 0;
				padding: 20px;
				color: white;
				background: rgba(0, 0, 0, 0.3);
				text-align: center;
				opacity: 0;
				transition: opacity 0.3s;

				h3 {
					color: white;
					margin: 0;

				}
			}

			.image-overlay.show-overlay {
				opacity: 1;
			}
		}

		.image-wrapper:hover {
			transform: scale(1.05);
		}
	}
</style>